app/Controllers/LoginController.php

    public function authenticate()
    {
        $uyelerModel = new UyelerModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Kullanıcıyı email ile bul
        $user = $uyelerModel->where('email', $email)->first();
---
SELECT *
FROM `uyeler`
WHERE `email` = 'rostreinn0@gmail.com'
 LIMIT 1